Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetAttributeFile Method (String)
 Gets a file info representing the first match in the standard property file directories.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static FileInfo GetAttributeFile(
	string fileName
)
Public Shared Function GetAttributeFile (
	fileName As String
) As FileInfo
Parameters
fileName
Type: System.String
The name of the file including the file extension.
Return Value
Type: FileInfo
A file info for the first match in the directory list. Null if no match was found.
See Also
Reference
EnvironmentFiles Class
GetAttributeFile Overload
Tekla.Structures.Dialog.UIControls Namespace